[
  {
    "id": "C&H",
    "name": "Chandrasekhar & Herschel Ltd.",
    "description": "Chandrasekhar & Herschel is one of the youngest Galactic-Tier corporations
to offer specialty mech licenses to qualified pilots. The company was founded
by Jun Chandrasekhar, a gladiator pilot and revolutionary leader, along with former
racing pilot Mattias Herschel. The initial license of incorporation was granted to
Chandrasekhar as a boon for her performance in the arena by self-appointed Emir
Julian Ambrose Khan during his tyrannical rule over the world of Suldan.
Chandrasekhar made use of the printer permissions granted to her as part of
incorporation to manufacture mechs and weaponry, covertly equipping the
beleaguered rebellion effort against the Emir. Mattias Herschel, a member of Suldan's
upper class who had been a prestigious chassis racer before his retirement, was
sympathetic towards the rebels and lent both his engineering expertise and his air of
legitimacy to Chandrasekhar's fledgling endeavor.
In the aftermath of the Emir's most recent death, both Chandraskehar and Herschel
discovered that their joint venture had attracted a growing and dedicated base of
pilots actively seeking out their licenses for use elsewhere. With infusions of capital
and designs from investors who prefer to remain anonymous, C&H Ltd. continued to
expand their offerings, and while they have a ways to go before they rise to the ranks
of corporations such as IPS-N Northstar or Smith-Shimano, forward-looking projections
remain optimistic as advertising and word of mouth continues to spread.
C&H focuses on what they refer to as “unorthodox combat solutions,” providing
specialized designs that larger corporations have eschewed or are slow in pivoting
towards. Their cores and licenses are frequently adapted from gladiatorial and
sporting mechs, and many of their weapons and systems were originally improvised
and adapted, or as some contest pirated, from other sources. As a result of this, their
mechs are as diverse as their origins, without the common thread that ties other
corporations' licenses together."
  }
]
